package com.jackl.mvparticle.network.cache;

public class CacheType {
      /**
       * -----------------------------------------------------------------
       * Copyright (C) 2018-2019, by jackl, All rights reserved.
       * -----------------------------------------------------------------
       *                      _ooOoo_
       *                     o8888888o
       *                     88" . "88
       *                     (| -_- |)
       *                      O\ = /O
       *                  ____/`---'\____
       *                .   ' \\| |// `.
       *                 / \\||| : |||// \
       *               / _||||| -:- |||||- \
       *                 | | \\\ - /// | |
       *              | \_| ''\---/'' | |
       *                \ .-\__ `-` ___/-. /
       *             ___`. .' /--.--\ `. . __
       *          ."" '< `.___\_<|>_/___.' >'"".
       *         | | : `- \`.;`\ _ /`;.`/ - ` : | |
       *           \ \ `-. \_ __\ /__ _/ .-` / /
       *   ======`-.____`-.___\_____/___.-`____.-'======
       *                      `=---='
       *   .............................................
       *            佛祖保佑             永无BUG
       * @Author: JackL
       * 创建时间: 2019/2/15 18:22
       * 版本:1.0.0
       * 描述: CacheType
       *
      */
      public static final String DISK_CACHE = "from disk cache";   //从硬盘缓存取值
      public static final String MEMORY_CACHE = "from memory cache"; //从内存缓存取值
}
