package com.jackl.mvparticle.rxBus.event;

/**
 * -----------------------------------------------------------------  
 * Copyright (C) 2018-2019, by jackl, All rights reserved.  
 * -----------------------------------------------------------------
 *                      _ooOoo_
 *                     o8888888o
 *                     88" . "88
 *                     (| -_- |)
 *                      O\ = /O
 *                  ____/`---'\____
 *                .   ' \\| |// `.
 *                 / \\||| : |||// \
 *               / _||||| -:- |||||- \
 *                 | | \\\ - /// | |
 *              | \_| ''\---/'' | |
 *                \ .-\__ `-` ___/-. /
 *             ___`. .' /--.--\ `. . __
 *          ."" '< `.___\_<|>_/___.' >'"".
 *         | | : `- \`.;`\ _ /`;.`/ - ` : | |
 *           \ \ `-. \_ __\ /__ _/ .-` / /
 *   ======`-.____`-.___\_____/___.-`____.-'======
 *                      `=---='
 *   .............................................
 *            佛祖保佑             永无BUG
 * @Author: JackL
 * 创建时间: 2019/1/11 10:33
 * 版本:1.0.0
 * 描述: SubEvent
 *     
*/

public class SubEvent {
    private final String minor;
    private final String type;

    public SubEvent(String minor, String type) {
        this.minor = minor;
        this.type = type;
    }
}
